#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура КАК Материал,
		|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Количество) КАК Количество,
		|	МАКСИМУМ(ОказаниеУслугиПереченьНоменклатуры.Стоимость) КАК МаксимальнаяСтоимость,
		|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Сумма) КАК Сумма,
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
		|ГДЕ
		|	ОказаниеУслугиПереченьНоменклатуры.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда
			Движение = Движения.ОстаткиМатериалов.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Материал = ВыборкаДетальныеЗаписи.Материал;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;

			Движение = Движения.СтоимостьМатериалов.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Материал = ВыборкаДетальныеЗаписи.Материал;
			Движение.Стоимость = ВыборкаДетальныеЗаписи.Количество * ВыборкаДетальныеЗаписи.МаксимальнаяСтоимость;
		КонецЕсли;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Материал;
		Движение.Клиент = Клиент;
		Движение.Мастер = Мастер;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Выручка = ВыборкаДетальныеЗаписи.Сумма;
		Движение.Стоимость = ВыборкаДетальныеЗаписи.Количество * ВыборкаДетальныеЗаписи.МаксимальнаяСтоимость;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли