#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьНоменклатуры

&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	// Получить текущую строку табличной части.
	ТекущаяСтрока = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	
	// Установить цену.
	ТекущаяСтрока.Цена = РаботаСоСправочникамиВызовСервера.РозничнаяЦена(Объект.Дата, ТекущаяСтрока.Номенклатура);
		
КонецПроцедуры
#КонецОбласти
