// @strict-types
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Наименование");
	Поля.Добавить("ВидНоменклатуры");
	Поля.Добавить("ЭтоГруппа");

	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// Параметры:
//  Данные - Структура:
//  	* Наименование - Строка - стандартный реквизит см. Справочник.Номенклатура
//  	* ВидНоменклатуры - ПеречислениеСсылка.ВидыНоменклатуры - пустая ссылка, если  перечисление не задано элементу
//  	справочника.
//  	* ЭтоГруппа - Булево
//  Представление - Строка
//	СтандартнаяОбработка - Булево 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если Данные.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.ПустаяСсылка() И Данные.ЭтоГруппа = Ложь Тогда
		Представление = Данные.Наименование + " (" + НРег(Строка(Данные.ВидНоменклатуры)) + ")";
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
КонецПроцедуры
#КонецОбласти